000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ИнтернетЗаказВнешниеДанные/ИнтернетЗаказВнешниеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИнтернетЗаказВнешниеДанные</name>
  <resources>
    <name>ПолученныеДанные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПолучений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоследняяОшибка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ВремяПолучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ИнтернетЗаказВнешниеДанные/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДанныеПотокаОбмена.ПолученныеДанные,
		|	ДанныеПотокаОбмена.КоличествоПолучений,
		|	ДанныеПотокаОбмена.ПоследняяОшибка
		|ИЗ
		|	РегистрСведений.ИнтернетЗаказВнешниеДанные КАК ДанныеПотокаОбмена
		|ГДЕ
		|	ДанныеПотокаОбмена.ВремяПолучения = &ВремяПолучения";
	
	Запрос.УстановитьПараметр("ВремяПолучения", Запись.ВремяПолучения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ПолученныеДанныеОбмена = Выборка.ПолученныеДанные.Получить();
		ПоследняяОшибка = Выборка.ПоследняяОшибка.Получить();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
